---
kind: property
id: P:Autodesk.Revit.DB.Macros.AddInIdAttribute.Value
source: html/0f46690d-6f7d-d9e2-5daa-60794b17c037.htm
---
# Autodesk.Revit.DB.Macros.AddInIdAttribute.Value Property

AddInId guid value.

## Syntax (C#)
```csharp
public ValueType Value { get; }
```